app/views/users/index.html.erb

SELECT  1 AS one FROM `friendships` WHERE `friendships`.`user_id` = 3 AND `friendships`.`friend_id` = 1 AND `friendships`.`user_id` = 3 LIMIT 1
SELECT  `friendships`.* FROM `friendships` WHERE `friendships`.`user_id` = 3 AND (friend_id = 2 AND user_id = 3) ORDER BY `friendships`.`id` ASC LIMIT 1
---
        <td><%= user.email %></td>
        <% friend_status = current_user.friendships.exists?(:friend_id =>user.id, :user_id => current_user.id)  ? true : false %>