app/views/home/index.html.erb

						<div class="col-sm-12">
							<% current_user.orders.each do |order|  %>
---
SELECT `orders`.* FROM `orders` WHERE `orders`.`user_id` = 3