app/controllers/friendships_controller.rb

  def create
  	  @friendship = current_user.friendships.build(:friend_id => params[:friend_id])
  	  if @friendship.save
---
INSERT INTO `friendships` (`user_id`, `friend_id`, `created_at`, `updated_at`) VALUES (3, 2, '2017-04-11 10:47:45', '2017-04-11 10:47:45')

    def destroy
  	  @friendship = current_user.friendships.find(params[:id])
  	  @friendship.destroy
---
SELECT  `friendships`.* FROM `friendships` WHERE `friendships`.`user_id` = 1 AND `friendships`.`id` = 5 LIMIT 1
DELETE FROM `friendships` WHERE `friendships`.`id` = 5