app/controllers/friends_controller.rb

  def invite_friend
    @user=current_user
    @member = User.find_by email: params[:email]
    respond_to do |format|
      if @member!=nil and @user.friends.include? @member
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'fdcf' LIMIT 1
SELECT  1 AS one FROM `users` INNER JOIN `friendships` ON `users`.`id` = `friendships`.`friend_id` WHERE `friendships`.`user_id` = 3 AND `users`.`id` = 4 LIMIT 1