app/controllers/groups_controller.rb

SELECT `groups`.* FROM `groups`
---
  def index
    @user=current_user
    @groups = Group.all

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'ali@g.com' LIMIT 1
SELECT  `groups`.* FROM `groups` ORDER BY `groups`.`id` DESC LIMIT 1
SELECT  1 AS one FROM `users` INNER JOIN `friendships` ON `users`.`id` = `friendships`.`friend_id` WHERE `friendships`.`user_id` = 3 AND `users`.`id` = 4 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 ORDER BY `users`.`id` ASC LIMIT 1
---
  def add_member
    @user=current_user
    @member = User.find_by email: params[:email]
    @group = Group.find params[:g_id]
    respond_to do |format|
      if @member!=nil and @group!=nil and @user.friends.include? @member

SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 16 LIMIT 1
---
  def get_all_members
    require "json"
    @group = Group.find params[:g_id]

SELECT  `groups`.* FROM `groups` ORDER BY `groups`.`id` DESC LIMIT 1
INSERT INTO `groups` (`name`, `user_id`, `created_at`, `updated_at`) VALUES ('group1_m', 3, '2017-04-11 10:48:13', '2017-04-11 10:48:13')
---
  def create
    @user=current_user
    @group = @user.groups.new({:name => params[:name], :user_id => params[:user_id]})
    respond_to do |format|
      if @group.save