app/controllers/home_controller.rb

  def index
    @notifications = Notification.all.reverse
---
SELECT `notifications`.* FROM `notifications`