app/controllers/order_details_controller.rb

  def index
    @order = Order.find(params[:order_id])
    @order_details = @order.order_details
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 2 LIMIT 1
SELECT `order_details`.* FROM `order_details` WHERE `order_details`.`order_id` = 2

  def get_all_orders
    @order = Order.find(params[:order_id])
    @order_details = @order.order_details
    names=[]
    orders={}
    @order_details.each {|ord|
        names.push(ord.user.name)
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1
SELECT `order_details`.* FROM `order_details` WHERE `order_details`.`order_id` = 1
UPDATE `users` SET `current_sign_in_at` = '2017-04-16 01:07:40', `last_sign_in_at` = '2017-04-16 11:46:37', `sign_in_count` = 3, `updated_at` = '2017-04-16 01:07:40' WHERE `users`.`id` = 2

  def create
    @order_detail = OrderDetail.new({user_id: params[:u_id], order_id: params[:o_id], item: params[:item], price: params[:price], amount: params[:amount], comment: params[:comment]})
    respond_to do |format|
      if @order_detail.save
---
INSERT INTO `order_details` (`user_id`, `order_id`, `item`, `amount`, `price`, `comment`, `created_at`, `updated_at`) VALUES (3, 2, 'ta3myya', 2, 3.0, 'eeeee', '2017-04-10 22:52:24', '2017-04-10 22:52:24')