app/controllers/orders_controller.rb

  def index
    @notifications = Notification.all.reverse

    @orders = current_user.orders.all
---
SELECT `notifications`.* FROM `notifications`
SELECT `orders`.* FROM `orders` WHERE `orders`.`user_id` = 3

  def new
    @notifications = Notification.all.reverse
---
SELECT `notifications`.* FROM `notifications`

  def create
    @notifications = Notification.all.reverse

    @user=User.find params[:user_id]
    @order = @user.orders.new(order_params)
    respond_to do |format|
      if @order.save
---
SELECT `notifications`.* FROM `notifications`
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 ORDER BY `users`.`id` ASC LIMIT 1
INSERT INTO `orders` (`meal`, `rest_name`, `menu_img`, `user_id`, `created_at`, `updated_at`) VALUES ('Breakfast', '', 'ruby.png', 3, '2017-04-10 12:12:10', '2017-04-10 12:12:10')

  def update
    respond_to do |format|
      if @order.update({status: false})
---
UPDATE `orders` SET `status` = 0, `updated_at` = '2017-04-10 16:07:22' WHERE `orders`.`id` = 2