app/controllers/users_controller.rb

  def index
    # @users = User.all
    @users = if params[:query].present?
      User.search params[:query], match: :word_start
---
SELECT `users`.* FROM `users`

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE `users` SET `encrypted_password` = '$2a$11$yEdVlmJQYO9h0ucEMb2bAerrGtEG79lQTLi7gs5evPNvLA8hxZDoO', `updated_at` = '2017-04-02 20:05:40' WHERE `users`.`id` = 2