app/views/layouts/_notification_center.html.erb

          <li>
            <% order = Order.find(orderFollowable.followable_id) %>
            <%= User.find(order.user_id).name + " invited you to his order " %>
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1